k8s.org
#+TITLE: k8s
#+OPTIONS: num:t
#+STARTUP: overview
#+EXPORT_FILE_NAME: /home/si/Dropbox/LiteraturPrograme/html/k8s.html
#+PROPERTY: header-args :eval no-export
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
* Docker
** pull
Docker daemon prefixes docker.io/library/ for default images on Docker Hub when no registry is specified
** build
#+begin_src 
  docker build -t name:tag .
  docker build -t entry-image -f /path/to/custom-dockerfile /path/to/build-context
#+end_src
  -t:  Name and optionally a tag (format: "name:tag")
  -  ADD and COPY can only access files within the build context specified in the docker build command (e.g., /path/to/build-context). Files outside the build context cannot be directly referenced in the Dockerfile.

** tag
#+begin_src
  docker tag my-current-image:tag my-username-in-dockerhub/my-wanted-image-name:mytag
  docker push my-current-image:tag my-username-in-dockerhub/my-wanted-image-name:mytag
#+end_src
tag change the name(with dockerhub name) and the tag for pushing
** Microservices
- Scalability	Each microservice can scale independently based on demand.
- Fault Isolation	Failure in one service does not crash the entire application.
- Faster Deployment	Teams can deploy and update services independently.
- Technology Flexibility	Different services can use different programming languages.
- Easier Maintenance	Smaller codebases are easier to manage and debug.

* Dokcerfile
** EXPOSE
Missing EXPOSE 5000 won’t break your setup if you explicitly map ports with -p 80:5000. It’s primarily a documentation and automation feature. For clarity and best practices, include EXPOSE 5000 in your Dockerfile to indicate the port your application uses.

** CMD echo "Hello World" && CMD ["echo", "Hello World"]
- CMD echo "Hello World":  start a shell and run the command, with shell features
- CMD ["echo", "Hello World"]:  run the command directly, withour to start a shell
- CMD: can be easyly overridden by docker run ...
** ENTRYPORT 
- Can only be explicitly overridden by docker run ... --entryport ...
- Implicity run without --entryport  after docker run... will append arguments at end

** Docker's multi-stage
builds offer a powerful way to manage production environments by separating build and runtime stages, ensuring smaller images, faster deployments, and enhanced security.
* Kubernetes
** Pod
Basic Pod-Related Commands
- Create a Pod: kubectl apply -f pod.yaml
- List all Pods: kubectl get pods
- List Pods with details: kubectl get pods -o wide
- Describe a Pod: kubectl describe pod <pod-name>
- View Pod logs: kubectl logs <pod-name>
- View logs for a specific container: kubectl logs <pod-name> -c <container-name>
- Stream live Pod logs: kubectl logs -f <pod-name>
- Execute a command in a Pod: kubectl exec -it <pod-name> -- /bin/bash
- Execute a command in a specific container: kubectl exec -it <pod-name> -c <container-name> -- /bin/bash
- Delete a Pod: kubectl delete pod <pod-name>
** Labels
- Labels: Key-value pairs attached to Kubernetes objects like pods, enabling logical grouping and selection.

- Kubernetes Features That Use Labels and Selectors:
  - ReplicationController,
  - ReplicaSet,
  - Deployments,
  - StatefulSets,
  - DaemonSets,
  - Services,
  - Jobs,
  - CronJobs,
  - and NetworkPolicies.
** Selectors
- Selectors: Expressions or equality-based filters used to match objects based on their labels, enabling precise control over resource management.
- It only apply to the Pod level(Node or Service), not to the container level

*** Equality-Based
for
- rc,
- rs,
- deployment
  #+begin_src
    selector:
      matchLabels:
        app: nginx
  #+end_src

