html/k8s.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-26 So 16:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>k8s</title>
<meta name="author" content="Silin Zhao" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">k8s</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org36f4670">1. Docker</a>
<ul>
<li><a href="#org8a388e6">1.1. pull</a></li>
<li><a href="#org510c7fb">1.2. build</a></li>
<li><a href="#org77f9a09">1.3. tag</a></li>
<li><a href="#orgad21eb0">1.4. Microservices</a></li>
</ul>
</li>
<li><a href="#org9a54290">2. Dokcerfile</a>
<ul>
<li><a href="#org8d779e2">2.1. EXPOSE</a></li>
<li><a href="#org3a61a9c">2.2. CMD echo "Hello World" &amp;&amp; CMD ["echo", "Hello World"]</a></li>
<li><a href="#org1d5fefa">2.3. ENTRYPORT</a></li>
<li><a href="#org5216002">2.4. Docker's multi-stage</a></li>
</ul>
</li>
<li><a href="#orgfd5bd11">3. Kubernetes</a>
<ul>
<li><a href="#orgec8780c">3.1. Pod</a></li>
<li><a href="#org919f68d">3.2. Labels</a></li>
<li><a href="#org2c6194a">3.3. Selectors</a>
<ul>
<li><a href="#org2c8ea89">3.3.1. Equality-Based</a></li>
<li><a href="#org246830c">3.3.2. Set-Based</a></li>
</ul>
</li>
<li><a href="#orgd44f57e">3.4. ReplicationController</a></li>
<li><a href="#org46467fc">3.5. ReplicaSet</a></li>
<li><a href="#org5316407">3.6. Deployment</a>
<ul>
<li><a href="#org46b175f">3.6.1. Annotation</a></li>
</ul>
</li>
<li><a href="#orgcd1c11d">3.7. Service</a>
<ul>
<li><a href="#org29b898a">3.7.1. ClusterIP</a></li>
<li><a href="#org812392a">3.7.2. NordPort</a></li>
<li><a href="#org63017ab">3.7.3. Loadbalance</a></li>
<li><a href="#orga83f5b1">3.7.4. ExternalName</a></li>
</ul>
</li>
<li><a href="#orgd87faaf">3.8. Manual scheduling</a></li>
<li><a href="#orge4086f7">3.9. Static pods</a></li>
<li><a href="#orgd99f50d">3.10. Node Selector</a>
<ul>
<li><a href="#org9a05b48">3.10.1. label: Apply label to node</a></li>
<li><a href="#org8809a64">3.10.2. selector apply to pod/Deployment</a></li>
<li><a href="#org7453070">3.10.3. Takeaway: Pure lebel matching mechanismus,l ack of flexibility, only with key-value matching selection</a></li>
</ul>
</li>
<li><a href="#org248e9e1">3.11. Taints and Tolerations</a>
<ul>
<li><a href="#orgdff8a82">3.11.1. Taints Apply to node</a></li>
<li><a href="#orgd728ae4">3.11.2. Toleration Apply to pod</a></li>
<li><a href="#org200b7c1">3.11.3. Takeaway: Lebel matching with hardness configuation, NoExecute supports re-evaluation. If a node’s taints change and a pod doesn’t tolerate them, it will be evicted</a></li>
</ul>
</li>
<li><a href="#orgb877688">3.12. Node Affinity</a>
<ul>
<li><a href="#orge37faf5">3.12.1. Takeaway: The most flexible way to optimize the resource utilization</a></li>
</ul>
</li>
<li><a href="#orgab4d23e">3.13. Request and limits</a>
<ul>
<li><a href="#org5f78293">3.13.1. Monitoring</a></li>
</ul>
</li>
<li><a href="#org8c3d899">3.14. Scaling</a>
<ul>
<li><a href="#orga9c05b1">3.14.1. Horizontal Scaling</a></li>
<li><a href="#org5d0cb53">3.14.2. Vertical Scaling</a></li>
<li><a href="#orgaa91e40">3.14.3. Node side</a></li>
</ul>
</li>
<li><a href="#orgf4adf37">3.15. Horizontal Pod Autoscaler (HPA)</a></li>
<li><a href="#orgab34d58">3.16. Vertical Pod Autoscaler (VPA)</a></li>
<li><a href="#org28f855f">3.17. Multi-container pods</a>
<ul>
<li><a href="#org60400d7">3.17.1. Init Containers</a></li>
<li><a href="#orgc06a7c9">3.17.2. Sidecar Pattern</a></li>
<li><a href="#org3c788ec">3.17.3. Ambassador Pattern</a></li>
<li><a href="#orgc49988b">3.17.4. Adapter Pattern</a></li>
</ul>
</li>
<li><a href="#orgda20b4b">3.18. Pod Policies</a>
<ul>
<li><a href="#org51d46b2">3.18.1. Delete policies</a></li>
<li><a href="#org1403072">3.18.2. Restart Policies</a></li>
<li><a href="#org6dd85e1">3.18.3. Image Pull Policies</a></li>
<li><a href="#org6225c1c">3.18.4. Pod Lifecycle and debugging see Day 22</a></li>
</ul>
</li>
<li><a href="#org7d0b6c7">3.19. health probes</a>
<ul>
<li><a href="#orge86a8be">3.19.1. Readiness Probes</a></li>
<li><a href="#orgb471047">3.19.2. Liveness Probes</a></li>
<li><a href="#orgd8470cb">3.19.3. Startup Probes</a></li>
</ul>
</li>
<li><a href="#orga7fe89a">3.20. Ephemeral Storage</a>
<ul>
<li><a href="#org2cb6cff">3.20.1. emptyDir</a></li>
<li><a href="#org1ca5d26">3.20.2. Downward API</a></li>
</ul>
</li>
<li><a href="#org0fe6ddf">3.21. Volume</a></li>
</ul>
</li>
<li><a href="#org2cd9dbe">4. Kubectl</a>
<ul>
<li><a href="#org163e6a3">4.1. Imperative Commands for Backend Deployment and Service</a></li>
<li><a href="#orga5db587">4.2. namespace</a></li>
<li><a href="#orgbcd7cc8">4.3. config</a></li>
</ul>
</li>
<li><a href="#org994fdd9">5. Matrics server</a></li>
</ul>
</div>
</div>
<div id="outline-container-org36f4670" class="outline-2">
<h2 id="org36f4670"><span class="section-number-2">1.</span> Docker</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8a388e6" class="outline-3">
<h3 id="org8a388e6"><span class="section-number-3">1.1.</span> pull</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Docker daemon prefixes docker.io/library/ for default images on Docker Hub when no registry is specified
</p>
</div>
</div>
<div id="outline-container-org510c7fb" class="outline-3">
<h3 id="org510c7fb"><span class="section-number-3">1.2.</span> build</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-nil">docker build -t name:tag .
docker build -t entry-image -f /path/to/custom-dockerfile /path/to/build-context
</pre>
</div>
<p>
-t:  Name and optionally a tag (format: "name:tag")
</p>
<ul class="org-ul">
<li>ADD and COPY can only access files within the build context specified in the docker build command (e.g., /path/to/build-context). Files outside the build context cannot be directly referenced in the Dockerfile.</li>
</ul>
</div>
</div>
<div id="outline-container-org77f9a09" class="outline-3">
<h3 id="org77f9a09"><span class="section-number-3">1.3.</span> tag</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-nil">docker tag my-current-image:tag my-username-in-dockerhub/my-wanted-image-name:mytag
docker push my-current-image:tag my-username-in-dockerhub/my-wanted-image-name:mytag
</pre>
</div>
<p>
tag change the name(with dockerhub name) and the tag for pushing
</p>
</div>
</div>
<div id="outline-container-orgad21eb0" class="outline-3">
<h3 id="orgad21eb0"><span class="section-number-3">1.4.</span> Microservices</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Scalability	Each microservice can scale independently based on demand.</li>
<li>Fault Isolation	Failure in one service does not crash the entire application.</li>
<li>Faster Deployment	Teams can deploy and update services independently.</li>
<li>Technology Flexibility	Different services can use different programming languages.</li>
<li>Easier Maintenance	Smaller codebases are easier to manage and debug.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9a54290" class="outline-2">
<h2 id="org9a54290"><span class="section-number-2">2.</span> Dokcerfile</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8d779e2" class="outline-3">
<h3 id="org8d779e2"><span class="section-number-3">2.1.</span> EXPOSE</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Missing EXPOSE 5000 won’t break your setup if you explicitly map ports with -p 80:5000. It’s primarily a documentation and automation feature. For clarity and best practices, include EXPOSE 5000 in your Dockerfile to indicate the port your application uses.
</p>
</div>
</div>
<div id="outline-container-org3a61a9c" class="outline-3">
<h3 id="org3a61a9c"><span class="section-number-3">2.2.</span> CMD echo "Hello World" &amp;&amp; CMD ["echo", "Hello World"]</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>CMD echo "Hello World":  start a shell and run the command, with shell features</li>
<li>CMD ["echo", "Hello World"]:  run the command directly, withour to start a shell</li>
<li>CMD: can be easyly overridden by docker run &#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org1d5fefa" class="outline-3">
<h3 id="org1d5fefa"><span class="section-number-3">2.3.</span> ENTRYPORT</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Can only be explicitly overridden by docker run &#x2026; &#x2013;entryport &#x2026;</li>
<li>Implicity run without &#x2013;entryport  after docker run&#x2026; will append arguments at end</li>
</ul>
</div>
</div>
<div id="outline-container-org5216002" class="outline-3">
<h3 id="org5216002"><span class="section-number-3">2.4.</span> Docker's multi-stage</h3>
<div class="outline-text-3" id="text-2-4">
<p>
builds offer a powerful way to manage production environments by separating build and runtime stages, ensuring smaller images, faster deployments, and enhanced security.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfd5bd11" class="outline-2">
<h2 id="orgfd5bd11"><span class="section-number-2">3.</span> Kubernetes</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgec8780c" class="outline-3">
<h3 id="orgec8780c"><span class="section-number-3">3.1.</span> Pod</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Basic Pod-Related Commands
</p>
<ul class="org-ul">
<li>Create a Pod: kubectl apply -f pod.yaml</li>
<li>List all Pods: kubectl get pods</li>
<li>List Pods with details: kubectl get pods -o wide</li>
<li>Describe a Pod: kubectl describe pod &lt;pod-name&gt;</li>
<li>View Pod logs: kubectl logs &lt;pod-name&gt;</li>
<li>View logs for a specific container: kubectl logs &lt;pod-name&gt; -c &lt;container-name&gt;</li>
<li>Stream live Pod logs: kubectl logs -f &lt;pod-name&gt;</li>
<li>Execute a command in a Pod: kubectl exec -it &lt;pod-name&gt; &#x2013; /bin/bash</li>
<li>Execute a command in a specific container: kubectl exec -it &lt;pod-name&gt; -c &lt;container-name&gt; &#x2013; /bin/bash</li>
<li>Delete a Pod: kubectl delete pod &lt;pod-name&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-org919f68d" class="outline-3">
<h3 id="org919f68d"><span class="section-number-3">3.2.</span> Labels</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Labels: Key-value pairs attached to Kubernetes objects like pods, enabling logical grouping and selection.</li>

<li>Kubernetes Features That Use Labels and Selectors:
<ul class="org-ul">
<li>ReplicationController,</li>
<li>ReplicaSet,</li>
<li>Deployments,</li>
<li>StatefulSets,</li>
<li>DaemonSets,</li>
<li>Services,</li>
<li>Jobs,</li>
<li>CronJobs,</li>
<li>and NetworkPolicies.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2c6194a" class="outline-3">
<h3 id="org2c6194a"><span class="section-number-3">3.3.</span> Selectors</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Selectors: Expressions or equality-based filters used to match objects based on their labels, enabling precise control over resource management.</li>
<li>It only apply to the Pod level(Node or Service), not to the container level</li>
</ul>
</div>
