k8s.org
*** Set-Based
- for rs, and deloyment
- usign: In, NotIn, Exists, DoesNotExist
  #+begin_src
  selector:
    matchExpressions:
      - key: app
        operator: In
        values:
          - nginx
          - apache
      - key: environment
        operator: NotIn
        values:
          - development
      - key: tier
        operator: Exists
      - key: debug
        operator: DoesNotExist
  #+end_src

** ReplicationController
- Ensures a specified number of pod replicas are running at any given time

** ReplicaSet
- ReplicaSet is an improved version of ReplicationController.
- It supports set-based selectors, providing more flexibility in managing pods.
- ReplicaSets are often managed by Deployments, which add advanced capabilities.
** Deployment
-  build on top of ReplicaSets, with rolling update and rollbacks, automated update, scaling and simplified management
*** Annotation
*A*: 
#+begin_src
apiVersion: apps/v1
kind: Deployment
metadata:
  annotations:
    kubernetes.io/change-cause: "Initial release with nginx 1.19"
  name: nginx-deployment
spec:
  ....
#+end_src

*B*: 
after applying the file and check the annoation
#+begin_src
  kubectl rollout history deployment nginx-deployment
#+end_src
I would able to see the default annotation.

*C*:
Then I can update my container for next version(only for deployment, not rc and rs)
#+begin_src
  kubectl set image deployment nginx-deployment nginx-container=nginx:1.20
#+end_src
 and set new annotation with
 #+begin_src
   kubectl annotate deployments nginx-deployment kubernetes.io/change-cause="Upgraded my container"
 #+end_src
OR modify my Deployment manifest and apply.
Now verify the history with
#+begin_src
  kubectl rollout history deployment nginx-deployment
#+end_src

 
*D*:
rollback to special version with
#+begin_src
  kubectl rollout undo deployment nginx-deployment --to-revision=1
#+end_src

** Service
- A fixed IP and DNS name so that pods can always be found, even if their individual IPs change.
- Load balancing across multiple pod replicas to distribute traffic evenly.
- Internal and external communication
*** ClusterIP

*** NordPort
*** Loadbalance
*** ExternalName

** Manual scheduling
- Explicitly assigning a pod to a node using the nodeName field in the pod’s YAML manifest
#+begin_src
apiVersion: v1
kind: Pod
metadata:
  name: nginx-manual
spec:
  nodeName: my-second-cluster-worker2  # Assign pod to a specific worker node
  containers:
    - name: nginx
      image: nginx
#+end_src
** Static pods
- Static pods are defined in /etc/kubernetes/manifests/ and  not managed by the Kubernetes API server
- To ensure visibility in kubectl get pods, Kubelet creates a read-only "mirror pod" on the API server

** Node Selector

*** label: Apply label to node
#+begin_src
  kubectl label nodes my-second-cluster-worker storage=ssd
  kubectl label nodes my-second-cluster-worker storage-
#+end_src
*** selector apply to pod/Deployment
#+begin_src
apiVersion: apps/v1
kind: Deployment
metadata:
  name: ns-deploy
spec:
  replicas: 3
  selector:
    matchLabels:
      app: app1
  template:
    metadata:
      labels:
        app: app1
    spec:
      nodeSelector:
        storage: ssd
      containers:
        - name: nginx
          image: nginx
#+end_src

- A node can have multiple labels. A pod will only be scheduled if all labels in nodeSelector match.

*** Takeaway: Pure lebel matching mechanismus,l ack of flexibility, only with key-value matching selection
** Taints and Tolerations
- Taints and Tolerations help control which pods can be scheduled on which nodes
- Taints and tolerations are applied during scheduling

*** Taints Apply to node
  #+begin_src 
    kubectl taint nodes my-second-cluster-worker storage=ssd:NoSchedule
    kubectl taint nodes my-second-cluster-worker2 storage=hdd:NoSchedule
    kubectl taint nodes my-second-cluster-worker storage=ssd:NoSchedule-  
  #+end_src

| Effect           | Behavior                                                                   |
|------------------+----------------------------------------------------------------------------|
| NoSchedule       | New pods will not be scheduled unless they have a matching toleration.     |
| PreferNoSchedule | Kubernetes tries to avoid scheduling pods but doesn’t enforce it strictly. |
| NoExecute        | Existing pods without a matching toleration will be evicted from the node. |

*** Toleration Apply to pod
#+begin_src
  tolerations:
  - key: "storage"
    operator: "Equal"
    value: "ssd"
    effect: "NoSchedule"
#+end_src

- This tolerates nodes that have the taint storage=ssd:NoSchedule, allowing the pod to be scheduled on them.
- The Effect in the toleration must match the Effect in the taint for it to take effect.
*** Takeaway: Lebel matching with hardness configuation, NoExecute supports re-evaluation. If a node’s taints change and a pod doesn’t tolerate them, it will be evicted
