html/k8s.html
<div id="outline-container-org2c8ea89" class="outline-4">
<h4 id="org2c8ea89"><span class="section-number-4">3.3.1.</span> Equality-Based</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
for
</p>
<ul class="org-ul">
<li>rc,</li>
<li>rs,</li>
<li><p>
deployment
</p>
<div class="org-src-container">
<pre class="src src-nil">selector:
  matchLabels:
    app: nginx
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org246830c" class="outline-4">
<h4 id="org246830c"><span class="section-number-4">3.3.2.</span> Set-Based</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>for rs, and deloyment</li>
<li><p>
usign: In, NotIn, Exists, DoesNotExist
</p>
<div class="org-src-container">
<pre class="src src-nil">selector:
  matchExpressions:
    - key: app
      operator: In
      values:
        - nginx
        - apache
    - key: environment
      operator: NotIn
      values:
        - development
    - key: tier
      operator: Exists
    - key: debug
      operator: DoesNotExist
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd44f57e" class="outline-3">
<h3 id="orgd44f57e"><span class="section-number-3">3.4.</span> ReplicationController</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Ensures a specified number of pod replicas are running at any given time</li>
</ul>
</div>
</div>
<div id="outline-container-org46467fc" class="outline-3">
<h3 id="org46467fc"><span class="section-number-3">3.5.</span> ReplicaSet</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>ReplicaSet is an improved version of ReplicationController.</li>
<li>It supports set-based selectors, providing more flexibility in managing pods.</li>
<li>ReplicaSets are often managed by Deployments, which add advanced capabilities.</li>
</ul>
</div>
</div>
<div id="outline-container-org5316407" class="outline-3">
<h3 id="org5316407"><span class="section-number-3">3.6.</span> Deployment</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>build on top of ReplicaSets, with rolling update and rollbacks, automated update, scaling and simplified management</li>
</ul>
</div>
<div id="outline-container-org46b175f" class="outline-4">
<h4 id="org46b175f"><span class="section-number-4">3.6.1.</span> Annotation</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
<b>A</b>: 
</p>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: apps/v1
kind: Deployment
metadata:
  annotations:
    kubernetes.io/change-cause: "Initial release with nginx 1.19"
  name: nginx-deployment
spec:
  ....
</pre>
</div>

<p>
<b>B</b>: 
after applying the file and check the annoation
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl rollout history deployment nginx-deployment
</pre>
</div>
<p>
I would able to see the default annotation.
</p>

<p>
<b>C</b>:
Then I can update my container for next version(only for deployment, not rc and rs)
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl set image deployment nginx-deployment nginx-container=nginx:1.20
</pre>
</div>
<p>
and set new annotation with
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl annotate deployments nginx-deployment kubernetes.io/change-cause="Upgraded my container"
</pre>
</div>
<p>
OR modify my Deployment manifest and apply.
Now verify the history with
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl rollout history deployment nginx-deployment
</pre>
</div>


<p>
<b>D</b>:
rollback to special version with
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl rollout undo deployment nginx-deployment --to-revision=1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcd1c11d" class="outline-3">
<h3 id="orgcd1c11d"><span class="section-number-3">3.7.</span> Service</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>A fixed IP and DNS name so that pods can always be found, even if their individual IPs change.</li>
<li>Load balancing across multiple pod replicas to distribute traffic evenly.</li>
<li>Internal and external communication</li>
</ul>
</div>
<div id="outline-container-org29b898a" class="outline-4">
<h4 id="org29b898a"><span class="section-number-4">3.7.1.</span> ClusterIP</h4>
</div>

<div id="outline-container-org812392a" class="outline-4">
<h4 id="org812392a"><span class="section-number-4">3.7.2.</span> NordPort</h4>
</div>
<div id="outline-container-org63017ab" class="outline-4">
<h4 id="org63017ab"><span class="section-number-4">3.7.3.</span> Loadbalance</h4>
</div>
<div id="outline-container-orga83f5b1" class="outline-4">
<h4 id="orga83f5b1"><span class="section-number-4">3.7.4.</span> ExternalName</h4>
</div>
</div>
<div id="outline-container-orgd87faaf" class="outline-3">
<h3 id="orgd87faaf"><span class="section-number-3">3.8.</span> Manual scheduling</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li>Explicitly assigning a pod to a node using the nodeName field in the pod’s YAML manifest</li>
</ul>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1
kind: Pod
metadata:
  name: nginx-manual
spec:
  nodeName: my-second-cluster-worker2  # Assign pod to a specific worker node
  containers:
    - name: nginx
      image: nginx
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4086f7" class="outline-3">
<h3 id="orge4086f7"><span class="section-number-3">3.9.</span> Static pods</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li>Static pods are defined in <i>etc/kubernetes/manifests</i> and  not managed by the Kubernetes API server</li>
<li>To ensure visibility in kubectl get pods, Kubelet creates a read-only "mirror pod" on the API server</li>
</ul>
</div>
</div>
<div id="outline-container-orgd99f50d" class="outline-3">
<h3 id="orgd99f50d"><span class="section-number-3">3.10.</span> Node Selector</h3>
<div class="outline-text-3" id="text-3-10">
</div>
<div id="outline-container-org9a05b48" class="outline-4">
<h4 id="org9a05b48"><span class="section-number-4">3.10.1.</span> label: Apply label to node</h4>
<div class="outline-text-4" id="text-3-10-1">
<div class="org-src-container">
<pre class="src src-nil">kubectl label nodes my-second-cluster-worker storage=ssd
kubectl label nodes my-second-cluster-worker storage-
</pre>
</div>
</div>
</div>
<div id="outline-container-org8809a64" class="outline-4">
<h4 id="org8809a64"><span class="section-number-4">3.10.2.</span> selector apply to pod/Deployment</h4>
<div class="outline-text-4" id="text-3-10-2">
<div class="org-src-container">
<pre class="src src-nil">apiVersion: apps/v1
kind: Deployment
metadata:
  name: ns-deploy
spec:
  replicas: 3
  selector:
    matchLabels:
      app: app1
  template:
    metadata:
      labels:
        app: app1
    spec:
      nodeSelector:
        storage: ssd
      containers:
        - name: nginx
          image: nginx
</pre>
</div>

<ul class="org-ul">
<li>A node can have multiple labels. A pod will only be scheduled if all labels in nodeSelector match.</li>
</ul>
</div>
</div>
<div id="outline-container-org7453070" class="outline-4">
<h4 id="org7453070"><span class="section-number-4">3.10.3.</span> Takeaway: Pure lebel matching mechanismus,l ack of flexibility, only with key-value matching selection</h4>
</div>
</div>
<div id="outline-container-org248e9e1" class="outline-3">
<h3 id="org248e9e1"><span class="section-number-3">3.11.</span> Taints and Tolerations</h3>
<div class="outline-text-3" id="text-3-11">
<ul class="org-ul">
<li>Taints and Tolerations help control which pods can be scheduled on which nodes</li>
<li>Taints and tolerations are applied during scheduling</li>
</ul>
</div>
<div id="outline-container-orgdff8a82" class="outline-4">
<h4 id="orgdff8a82"><span class="section-number-4">3.11.1.</span> Taints Apply to node</h4>
<div class="outline-text-4" id="text-3-11-1">
<div class="org-src-container">
<pre class="src src-nil">kubectl taint nodes my-second-cluster-worker storage=ssd:NoSchedule
kubectl taint nodes my-second-cluster-worker2 storage=hdd:NoSchedule
kubectl taint nodes my-second-cluster-worker storage=ssd:NoSchedule-  
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Effect</th>
<th scope="col" class="org-left">Behavior</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">NoSchedule</td>
<td class="org-left">New pods will not be scheduled unless they have a matching toleration.</td>
</tr>

<tr>
<td class="org-left">PreferNoSchedule</td>
<td class="org-left">Kubernetes tries to avoid scheduling pods but doesn’t enforce it strictly.</td>
</tr>

<tr>
<td class="org-left">NoExecute</td>
<td class="org-left">Existing pods without a matching toleration will be evicted from the node.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd728ae4" class="outline-4">
<h4 id="orgd728ae4"><span class="section-number-4">3.11.2.</span> Toleration Apply to pod</h4>
<div class="outline-text-4" id="text-3-11-2">
<div class="org-src-container">
<pre class="src src-nil">tolerations:
- key: "storage"
  operator: "Equal"
  value: "ssd"
  effect: "NoSchedule"
</pre>
</div>

<ul class="org-ul">
<li>This tolerates nodes that have the taint storage=ssd:NoSchedule, allowing the pod to be scheduled on them.</li>
<li>The Effect in the toleration must match the Effect in the taint for it to take effect.</li>
</ul>
</div>
</div>
<div id="outline-container-org200b7c1" class="outline-4">
<h4 id="org200b7c1"><span class="section-number-4">3.11.3.</span> Takeaway: Lebel matching with hardness configuation, NoExecute supports re-evaluation. If a node’s taints change and a pod doesn’t tolerate them, it will be evicted</h4>
</div>
</div>
