k8s.org
** Node Affinity
- requiredDuringSchedulingIgnoredDuringExecution: Hard rule, must match
- preferredDuringSchedulingIgnoredDuringExecution: Soft rule, NOT must
- node labels are the same with node selector
- all requests from matchExpressions need to be filled
#+begin_src
apiVersion: apps/v1
kind: Deployment
metadata:
  name: preferred-na-deploy
spec:
  replicas: 5
  selector:
    matchLabels:
      app: app1
  template:
    metadata:
      labels:
        app: app1
    spec:
      affinity:
        nodeAffinity:
          requiredDuringSchedulingIgnoredDuringExecution:
            nodeSelectorTerms:
            - matchExpressions:
              - key: storage
                operator: In
                values:
                  - ssd
                  - hdd
          preferredDuringSchedulingIgnoredDuringExecution:
            - weight: 10
              preference:
                matchExpressions:
                  - key: storage
                    operator: In
                    values:
                      - ssd
            - weight: 5
              preference:
                matchExpressions:
                  - key: storage
                    operator: In
                    values:
                      - hdd
      containers:
        - name: nginx
          image: nginx
#+end_src


| Operator     | Behavior                                                            |
|--------------+---------------------------------------------------------------------|
| In           | Matches if the node’s label exists in the provided values.          |
| NotIn        | Matches if the node’s label does not exist in the provided values.  |
| Exists       | Matches if the node has the specified key, regardless of its value. |
| DoesNotExist | Matches if the node does not have the specified key.                |
| Gt           | Matches if the label’s value is greater than the specified number.  |
| Lt           | Matches if the label’s value is less than the specified number.     |
  


*** Takeaway: The most flexible way to optimize the resource utilization

** Request and limits
- Requests and limits must be defined per container inside a Pod.
- If a container exceeds its requested resources, it can still use more resources if available on the node.
- If a container exceeds its requested CPU resource: CPU is a compressible resource, so workloads slow down instead of failing
- If a container exceeds its requested Memary resource: the kernel may kill it,  But If there is no memory pressure, the container may not be killed immediately
*** Monitoring
Install metrics server on Kubernetes
#+begin_src
  kubectl top nodes
#+end_src

** Scaling
- Scaling refers to adjusting the resources available to an application based on its demand/load.
*** Horizontal Scaling
- Scale-Out: Increasing the number of pod replicas
- Scaling In: Removing instances/pods when load decreases
- Manually: Editing the Deployment YAML (replicas field) and apply
- Automatic: HPA (Horizontal Pod Autoscaler)

  
*** Vertical Scaling
- Scaling Up: Increasing CPU/Memory resources of the existing pod or VM.
- Scaling Down: Reducing CPU/Memory.
- Manually: Editing the Deployment YAML (replicas field) and apply
- Automatic: VPA (Vertical Pod Autoscaler)


*** Node side
clusters rely on horizontal scaling of nodes to maintain availability. vertical scaling requeir restarting, which is not working for production environment

** Horizontal Pod Autoscaler (HPA)
based on the default/custom/External Resource Metrics to automatically scale out/in


** Vertical Pod Autoscaler (VPA)
** Multi-container pods
a primary container complemented by one or more helper containers
*** Init Containers
successfully complete before the primary container runs as pre-requests
#+begin_src
apiVersion: v1
kind: Pod
metadata:
  name: init-demo
spec:
  initContainers:
  - name: check-api
    image: curlimages/curl:latest
    command:
      - sh
      - -c
      - |
        echo 'Checking API availability...'
        sleep 25
        until curl -s https://kubernetes.io > /dev/null; do
          echo 'Waiting for API...'
          sleep 5
        done
        echo 'API is accessible, proceeding to main-app container!'
  containers:
  - name: main-app
    image: nginx:latest
#+end_src
*** Sidecar Pattern
run alongside the primary container and operate independently to extend or complement the main container's functionality.
#+begin_src
apiVersion: v1
kind: Pod
metadata:
  name: sidecar-logging-demo
spec:
  containers:
  # Main application container
  - name: main-app
    image: nginx:latest
    ports:
    - containerPort: 80
  # Sidecar container
  - name: health-logger
    image: curlimages/curl:latest
    command:
    - sh
    - -c
    - |
      while true; do
        curl -s http://localhost:80 > /dev/null && echo 'Main app is healthy' || echo 'Main app is unhealthy'
        sleep 5
      done

#+end_src
*** Ambassador Pattern
like sidecar but only focus on handling external communication
*** Adapter Pattern
like sidecar but only focus on data transforming or normalizing

** Pod Policies
*** Delete policies
- graceful termination for 30 seconds, after that SIGKILL will terminate it immediately if it still lives
  #+begin_src
apiVersion: v1
kind: Pod
metadata:
  name: nginx- graceful
spec:
  terminationGracePeriodSeconds: 30
  containers:
  - name: nginx
    image: nginx:latest
  #+end_src
apply and delete
    #+begin_src
    kubectl delete pod xxx
  #+end_src

  for forceful deletion:
  #+begin_src
    kubectl delete pod mypod --force=true --grace-period=0
  #+end_src

