html/k8s.html
<div id="outline-container-orgb877688" class="outline-3">
<h3 id="orgb877688"><span class="section-number-3">3.12.</span> Node Affinity</h3>
<div class="outline-text-3" id="text-3-12">
<ul class="org-ul">
<li>requiredDuringSchedulingIgnoredDuringExecution: Hard rule, must match</li>
<li>preferredDuringSchedulingIgnoredDuringExecution: Soft rule, NOT must</li>
<li>node labels are the same with node selector</li>
<li>all requests from matchExpressions need to be filled</li>
</ul>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: apps/v1
kind: Deployment
metadata:
  name: preferred-na-deploy
spec:
  replicas: 5
  selector:
    matchLabels:
      app: app1
  template:
    metadata:
      labels:
        app: app1
    spec:
      affinity:
        nodeAffinity:
          requiredDuringSchedulingIgnoredDuringExecution:
            nodeSelectorTerms:
            - matchExpressions:
              - key: storage
                operator: In
                values:
                  - ssd
                  - hdd
          preferredDuringSchedulingIgnoredDuringExecution:
            - weight: 10
              preference:
                matchExpressions:
                  - key: storage
                    operator: In
                    values:
                      - ssd
            - weight: 5
              preference:
                matchExpressions:
                  - key: storage
                    operator: In
                    values:
                      - hdd
      containers:
        - name: nginx
          image: nginx
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Behavior</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">In</td>
<td class="org-left">Matches if the node’s label exists in the provided values.</td>
</tr>

<tr>
<td class="org-left">NotIn</td>
<td class="org-left">Matches if the node’s label does not exist in the provided values.</td>
</tr>

<tr>
<td class="org-left">Exists</td>
<td class="org-left">Matches if the node has the specified key, regardless of its value.</td>
</tr>

<tr>
<td class="org-left">DoesNotExist</td>
<td class="org-left">Matches if the node does not have the specified key.</td>
</tr>

<tr>
<td class="org-left">Gt</td>
<td class="org-left">Matches if the label’s value is greater than the specified number.</td>
</tr>

<tr>
<td class="org-left">Lt</td>
<td class="org-left">Matches if the label’s value is less than the specified number.</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orge37faf5" class="outline-4">
<h4 id="orge37faf5"><span class="section-number-4">3.12.1.</span> Takeaway: The most flexible way to optimize the resource utilization</h4>
</div>
</div>
<div id="outline-container-orgab4d23e" class="outline-3">
<h3 id="orgab4d23e"><span class="section-number-3">3.13.</span> Request and limits</h3>
<div class="outline-text-3" id="text-3-13">
<ul class="org-ul">
<li>Requests and limits must be defined per container inside a Pod.</li>
<li>If a container exceeds its requested resources, it can still use more resources if available on the node.</li>
<li>If a container exceeds its requested CPU resource: CPU is a compressible resource, so workloads slow down instead of failing</li>
<li>If a container exceeds its requested Memary resource: the kernel may kill it,  But If there is no memory pressure, the container may not be killed immediately</li>
</ul>
</div>
<div id="outline-container-org5f78293" class="outline-4">
<h4 id="org5f78293"><span class="section-number-4">3.13.1.</span> Monitoring</h4>
<div class="outline-text-4" id="text-3-13-1">
<p>
Install metrics server on Kubernetes
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl top nodes
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8c3d899" class="outline-3">
<h3 id="org8c3d899"><span class="section-number-3">3.14.</span> Scaling</h3>
<div class="outline-text-3" id="text-3-14">
<ul class="org-ul">
<li>Scaling refers to adjusting the resources available to an application based on its demand/load.</li>
</ul>
</div>
<div id="outline-container-orga9c05b1" class="outline-4">
<h4 id="orga9c05b1"><span class="section-number-4">3.14.1.</span> Horizontal Scaling</h4>
<div class="outline-text-4" id="text-3-14-1">
<ul class="org-ul">
<li>Scale-Out: Increasing the number of pod replicas</li>
<li>Scaling In: Removing instances/pods when load decreases</li>
<li>Manually: Editing the Deployment YAML (replicas field) and apply</li>
<li>Automatic: HPA (Horizontal Pod Autoscaler)</li>
</ul>
</div>
</div>
<div id="outline-container-org5d0cb53" class="outline-4">
<h4 id="org5d0cb53"><span class="section-number-4">3.14.2.</span> Vertical Scaling</h4>
<div class="outline-text-4" id="text-3-14-2">
<ul class="org-ul">
<li>Scaling Up: Increasing CPU/Memory resources of the existing pod or VM.</li>
<li>Scaling Down: Reducing CPU/Memory.</li>
<li>Manually: Editing the Deployment YAML (replicas field) and apply</li>
<li>Automatic: VPA (Vertical Pod Autoscaler)</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa91e40" class="outline-4">
<h4 id="orgaa91e40"><span class="section-number-4">3.14.3.</span> Node side</h4>
<div class="outline-text-4" id="text-3-14-3">
<p>
clusters rely on horizontal scaling of nodes to maintain availability. vertical scaling requeir restarting, which is not working for production environment
</p>
</div>
</div>
</div>
<div id="outline-container-orgf4adf37" class="outline-3">
<h3 id="orgf4adf37"><span class="section-number-3">3.15.</span> Horizontal Pod Autoscaler (HPA)</h3>
<div class="outline-text-3" id="text-3-15">
<p>
based on the default/custom/External Resource Metrics to automatically scale out/in
</p>
</div>
</div>
<div id="outline-container-orgab34d58" class="outline-3">
<h3 id="orgab34d58"><span class="section-number-3">3.16.</span> Vertical Pod Autoscaler (VPA)</h3>
</div>
<div id="outline-container-org28f855f" class="outline-3">
<h3 id="org28f855f"><span class="section-number-3">3.17.</span> Multi-container pods</h3>
<div class="outline-text-3" id="text-3-17">
<p>
a primary container complemented by one or more helper containers
</p>
</div>
<div id="outline-container-org60400d7" class="outline-4">
<h4 id="org60400d7"><span class="section-number-4">3.17.1.</span> Init Containers</h4>
<div class="outline-text-4" id="text-3-17-1">
<p>
successfully complete before the primary container runs as pre-requests
</p>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1
kind: Pod
metadata:
  name: init-demo
spec:
  initContainers:
  - name: check-api
    image: curlimages/curl:latest
    command:
      - sh
      - -c
      - |
        echo 'Checking API availability...'
        sleep 25
        until curl -s https://kubernetes.io &gt; /dev/null; do
          echo 'Waiting for API...'
          sleep 5
        done
        echo 'API is accessible, proceeding to main-app container!'
  containers:
  - name: main-app
    image: nginx:latest
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc06a7c9" class="outline-4">
<h4 id="orgc06a7c9"><span class="section-number-4">3.17.2.</span> Sidecar Pattern</h4>
<div class="outline-text-4" id="text-3-17-2">
<p>
run alongside the primary container and operate independently to extend or complement the main container's functionality.
</p>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1
kind: Pod
metadata:
  name: sidecar-logging-demo
spec:
  containers:
  # Main application container
  - name: main-app
    image: nginx:latest
    ports:
    - containerPort: 80
  # Sidecar container
  - name: health-logger
    image: curlimages/curl:latest
    command:
    - sh
    - -c
    - |
      while true; do
        curl -s http://localhost:80 &gt; /dev/null &amp;&amp; echo 'Main app is healthy' || echo 'Main app is unhealthy'
        sleep 5
      done

</pre>
</div>
</div>
</div>
<div id="outline-container-org3c788ec" class="outline-4">
<h4 id="org3c788ec"><span class="section-number-4">3.17.3.</span> Ambassador Pattern</h4>
<div class="outline-text-4" id="text-3-17-3">
<p>
like sidecar but only focus on handling external communication
</p>
</div>
</div>
<div id="outline-container-orgc49988b" class="outline-4">
<h4 id="orgc49988b"><span class="section-number-4">3.17.4.</span> Adapter Pattern</h4>
<div class="outline-text-4" id="text-3-17-4">
<p>
like sidecar but only focus on data transforming or normalizing
</p>
</div>
</div>
</div>
<div id="outline-container-orgda20b4b" class="outline-3">
<h3 id="orgda20b4b"><span class="section-number-3">3.18.</span> Pod Policies</h3>
<div class="outline-text-3" id="text-3-18">
</div>
<div id="outline-container-org51d46b2" class="outline-4">
<h4 id="org51d46b2"><span class="section-number-4">3.18.1.</span> Delete policies</h4>
<div class="outline-text-4" id="text-3-18-1">
<ul class="org-ul">
<li><p>
graceful termination for 30 seconds, after that SIGKILL will terminate it immediately if it still lives
</p>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1
kind: Pod
metadata:
  name: nginx- graceful
spec:
  terminationGracePeriodSeconds: 30
  containers:
  - name: nginx
    image: nginx:latest
</pre>
</div></li>
</ul>
<p>
apply and delete
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl delete pod xxx
</pre>
</div>

<p>
for forceful deletion:
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl delete pod mypod --force=true --grace-period=0
</pre>
</div>
</div>
</div>
