k8s.org
*** Restart Policies
how Kubernetes responds when containers within a pod terminate, it's at the pod level and apply to all containers within the pod
- Always(whether it succeeds with exit code 0 or fails with a non-zero exit code): Pods, Deployments, ReplicaSets, StatefulSets, DaemonSets
- OnFailure (exit code 0): Jobs, Cronjobs
- Never: not restarted, regardless of the exit code (whether it succeeds or fails)

  #+begin_src
apiVersion: batch/v1
kind: Job
metadata:
  name: batch-job-example
spec:
  template:
    spec:
      restartPolicy: OnFailure
      containers:
      - name: processor
        image: my-batch-job:latest
  #+end_src

*** Image Pull Policies
how the container runtime pulls container images for initialization. At Container level for each containter customizable
#+begin_src
apiVersion: v1
kind: Pod
metadata:
  name: always-example
spec:
  containers:
  - name: my-app
    image: myrepo/my-app:latest
    imagePullPolicy: Always
#+end_src

- Always, default, prefer for development
- IfNotPresent, only NOT available on the node cache
- Never, assuming the image is already present on the node.
- if Image tag is latest, default police is Always,
- if image tag is with specific version tag, default police is IfNotPresent

*** Pod Lifecycle and debugging see [[https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/tree/main/Day%2022][Day 22]]





** health probes
The kubelet is responsible for performing these probes. 
*** Readiness Probes
only health pods receiving traffic, otherwise removed, no restart
*** Liveness Probes
with restarting if failed
*** Startup Probes
set threshold times of attempts before marked as failed for slow-starting

** Ephemeral Storage
*** emptyDir
It is ideal for scratch space (Temporary workspace for processing.), caching, or temporary computations where data persistence isn’t required.

#+begin_src
apiVersion: v1  # Specifies the API version used to create the Pod.
kind: Pod       # Declares the resource type as a Pod.
metadata:
  name: emptydir-example  # Name of the Pod.
spec:
  containers:
  - name: busybox-container  # Name of the container inside the Pod.
    image: busybox           # Using the lightweight BusyBox image.
    command: ["/bin/sh", "-c", "sleep 3600"]  # Overrides the default command. Keeps the container running for 1 hour (3600 seconds).
    volumeMounts:
    - mountPath: /data       # Mount point inside the container where the volume will be accessible.
      name: temp-storage     # Refers to the volume defined in the `volumes` section below.
  - name: busybox-container-2  # Name of the container inside the Pod.
    image: busybox           # Using the lightweight BusyBox image.
    command: ["/bin/sh", "-c", "sleep 3600"]
    volumeMounts:
    - mountPath: /data
      name: temp-storage
  volumes:
  - name: temp-storage       # Name of the volume, must match the name in `volumeMounts`.
    emptyDir: {}             # Creates a temporary directory that lives as long as the Pod exists.
                            # Useful for storing transient data that doesn't need to persist.

#+end_src
all containter by applying this yaml will access the same data as in volume.

*** Downward API
- It injectes into containers in a Pod either as environment variables or through mounted files via volumes
- Just like Sidecar pattern, This helps sidecar containter to get matrics from the main contrainter.
- please refer [[https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/tree/main/Day%2026][env and file mount at github]]
  


** Volume
[[https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/blob/main/Day%2027/README.md][link]]
- hostPath: Persistent change map to host machine, the data can be shared between different pods only if they are scheduled on the same node.
- Storage class, a replace of pv
- pv (persistentvolume) clain a  physical  storage(retain, delete) global at cluster level
- pvc(persistentvolumeClaim) use the pv under a namespace, all the charactore muss be passend
- pod, chaim the volume and mount it to somewhere in container
- to delete, pod at first, otherwise pv/pvc hold still until pod died

* Kubectl
** Imperative Commands for Backend Deployment and Service
Use --dry-run=client for local validation and --dry-run=server for API server validation
#+begin_src
  kubectl create deployment backend-deploy \
  --image=hashicorp/http-echo \
  --replicas=3 \
  --port=5678 \
  --dry-run=client -o yaml > backend-deploy.yaml
#+end_src

#+begin_src
  kubectl expose deployment backend-deploy \
  --type=ClusterIP \
  --port=9090 \
  --target-port=5678 \
  --name=backend-svc \
  --dry-run=client -o yaml >> backend-deploy.yaml
#+end_src


** namespace
- Context contains cluster, users, and namespace, they are not coupled.
#+begin_src
  kubectl config set-context --current --namespace=app1-ns
#+end_src
- This command is to change the namespace of a contex.

** config
* Matrics server
kubectl apply -f https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
