html/k8s.html
<div id="outline-container-org1403072" class="outline-4">
<h4 id="org1403072"><span class="section-number-4">3.18.2.</span> Restart Policies</h4>
<div class="outline-text-4" id="text-3-18-2">
<p>
how Kubernetes responds when containers within a pod terminate, it's at the pod level and apply to all containers within the pod
</p>
<ul class="org-ul">
<li>Always(whether it succeeds with exit code 0 or fails with a non-zero exit code): Pods, Deployments, ReplicaSets, StatefulSets, DaemonSets</li>
<li>OnFailure (exit code 0): Jobs, Cronjobs</li>
<li><p>
Never: not restarted, regardless of the exit code (whether it succeeds or fails)
</p>

<div class="org-src-container">
<pre class="src src-nil">apiVersion: batch/v1
kind: Job
metadata:
  name: batch-job-example
spec:
  template:
    spec:
      restartPolicy: OnFailure
      containers:
      - name: processor
        image: my-batch-job:latest
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org6dd85e1" class="outline-4">
<h4 id="org6dd85e1"><span class="section-number-4">3.18.3.</span> Image Pull Policies</h4>
<div class="outline-text-4" id="text-3-18-3">
<p>
how the container runtime pulls container images for initialization. At Container level for each containter customizable
</p>
<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1
kind: Pod
metadata:
  name: always-example
spec:
  containers:
  - name: my-app
    image: myrepo/my-app:latest
    imagePullPolicy: Always
</pre>
</div>

<ul class="org-ul">
<li>Always, default, prefer for development</li>
<li>IfNotPresent, only NOT available on the node cache</li>
<li>Never, assuming the image is already present on the node.</li>
<li>if Image tag is latest, default police is Always,</li>
<li>if image tag is with specific version tag, default police is IfNotPresent</li>
</ul>
</div>
</div>
<div id="outline-container-org6225c1c" class="outline-4">
<h4 id="org6225c1c"><span class="section-number-4">3.18.4.</span> Pod Lifecycle and debugging see <a href="https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/tree/main/Day%2022">Day 22</a></h4>
</div>
</div>
<div id="outline-container-org7d0b6c7" class="outline-3">
<h3 id="org7d0b6c7"><span class="section-number-3">3.19.</span> health probes</h3>
<div class="outline-text-3" id="text-3-19">
<p>
The kubelet is responsible for performing these probes. 
</p>
</div>
<div id="outline-container-orge86a8be" class="outline-4">
<h4 id="orge86a8be"><span class="section-number-4">3.19.1.</span> Readiness Probes</h4>
<div class="outline-text-4" id="text-3-19-1">
<p>
only health pods receiving traffic, otherwise removed, no restart
</p>
</div>
</div>
<div id="outline-container-orgb471047" class="outline-4">
<h4 id="orgb471047"><span class="section-number-4">3.19.2.</span> Liveness Probes</h4>
<div class="outline-text-4" id="text-3-19-2">
<p>
with restarting if failed
</p>
</div>
</div>
<div id="outline-container-orgd8470cb" class="outline-4">
<h4 id="orgd8470cb"><span class="section-number-4">3.19.3.</span> Startup Probes</h4>
<div class="outline-text-4" id="text-3-19-3">
<p>
set threshold times of attempts before marked as failed for slow-starting
</p>
</div>
</div>
</div>
<div id="outline-container-orga7fe89a" class="outline-3">
<h3 id="orga7fe89a"><span class="section-number-3">3.20.</span> Ephemeral Storage</h3>
<div class="outline-text-3" id="text-3-20">
</div>
<div id="outline-container-org2cb6cff" class="outline-4">
<h4 id="org2cb6cff"><span class="section-number-4">3.20.1.</span> emptyDir</h4>
<div class="outline-text-4" id="text-3-20-1">
<p>
It is ideal for scratch space (Temporary workspace for processing.), caching, or temporary computations where data persistence isn’t required.
</p>

<div class="org-src-container">
<pre class="src src-nil">apiVersion: v1  # Specifies the API version used to create the Pod.
kind: Pod       # Declares the resource type as a Pod.
metadata:
  name: emptydir-example  # Name of the Pod.
spec:
  containers:
  - name: busybox-container  # Name of the container inside the Pod.
    image: busybox           # Using the lightweight BusyBox image.
    command: ["/bin/sh", "-c", "sleep 3600"]  # Overrides the default command. Keeps the container running for 1 hour (3600 seconds).
    volumeMounts:
    - mountPath: /data       # Mount point inside the container where the volume will be accessible.
      name: temp-storage     # Refers to the volume defined in the `volumes` section below.
  - name: busybox-container-2  # Name of the container inside the Pod.
    image: busybox           # Using the lightweight BusyBox image.
    command: ["/bin/sh", "-c", "sleep 3600"]
    volumeMounts:
    - mountPath: /data
      name: temp-storage
  volumes:
  - name: temp-storage       # Name of the volume, must match the name in `volumeMounts`.
    emptyDir: {}             # Creates a temporary directory that lives as long as the Pod exists.
                            # Useful for storing transient data that doesn't need to persist.

</pre>
</div>
<p>
all containter by applying this yaml will access the same data as in volume.
</p>
</div>
</div>
<div id="outline-container-org1ca5d26" class="outline-4">
<h4 id="org1ca5d26"><span class="section-number-4">3.20.2.</span> Downward API</h4>
<div class="outline-text-4" id="text-3-20-2">
<ul class="org-ul">
<li>It injectes into containers in a Pod either as environment variables or through mounted files via volumes</li>
<li>Just like Sidecar pattern, This helps sidecar containter to get matrics from the main contrainter.</li>
<li>please refer <a href="https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/tree/main/Day%2026">env and file mount at github</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0fe6ddf" class="outline-3">
<h3 id="org0fe6ddf"><span class="section-number-3">3.21.</span> Volume</h3>
<div class="outline-text-3" id="text-3-21">
<p>
<a href="https://github.com/CloudWithVarJosh/CKA-Certification-Course-2025/blob/main/Day%2027/README.md">link</a>
</p>
<ul class="org-ul">
<li>hostPath: Persistent change map to host machine, the data can be shared between different pods only if they are scheduled on the same node.</li>
<li>Storage class, a replace of pv</li>
<li>pv (persistentvolume) clain a  physical  storage(retain, delete) global at cluster level</li>
<li>pvc(persistentvolumeClaim) use the pv under a namespace, all the charactore muss be passend</li>
<li>pod, chaim the volume and mount it to somewhere in container</li>
<li>to delete, pod at first, otherwise pv/pvc hold still until pod died</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2cd9dbe" class="outline-2">
<h2 id="org2cd9dbe"><span class="section-number-2">4.</span> Kubectl</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org163e6a3" class="outline-3">
<h3 id="org163e6a3"><span class="section-number-3">4.1.</span> Imperative Commands for Backend Deployment and Service</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Use &#x2013;dry-run=client for local validation and &#x2013;dry-run=server for API server validation
</p>
<div class="org-src-container">
<pre class="src src-nil">kubectl create deployment backend-deploy \
--image=hashicorp/http-echo \
--replicas=3 \
--port=5678 \
--dry-run=client -o yaml &gt; backend-deploy.yaml
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">kubectl expose deployment backend-deploy \
--type=ClusterIP \
--port=9090 \
--target-port=5678 \
--name=backend-svc \
--dry-run=client -o yaml &gt;&gt; backend-deploy.yaml
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5db587" class="outline-3">
<h3 id="orga5db587"><span class="section-number-3">4.2.</span> namespace</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Context contains cluster, users, and namespace, they are not coupled.</li>
</ul>
<div class="org-src-container">
<pre class="src src-nil">kubectl config set-context --current --namespace=app1-ns
</pre>
</div>
<ul class="org-ul">
<li>This command is to change the namespace of a contex.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbcd7cc8" class="outline-3">
<h3 id="orgbcd7cc8"><span class="section-number-3">4.3.</span> config</h3>
</div>
</div>
<div id="outline-container-org994fdd9" class="outline-2">
<h2 id="org994fdd9"><span class="section-number-2">5.</span> Matrics server</h2>
<div class="outline-text-2" id="text-5">
<p>
kubectl apply -f <a href="https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml">https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Silin Zhao</p>
<p class="date">Created: 2025-10-26 So 16:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
